sisred/app/controllers/operaciones_controller.rb

  def index
    @operaciones = Operacione.all
---
SELECT "operaciones".* FROM "operaciones"

  def create
    @operacione = Operacione.new(operacione_params)

    respond_to do |format|
      if @operacione.save
---
INSERT INTO "operaciones" ("referencia", "pedimento", "cliente", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["referencia", "DESI0132/18"], ["pedimento", "3809-8000132"], ["cliente", "ZONDA CORPORATION"], ["created_at", "2018-08-22 03:37:05.393578"], ["updated_at", "2018-08-22 03:37:05.393578"]]

  def update
    respond_to do |format|
      if @operacione.update(operacione_params)
---
UPDATE "operaciones" SET "referencia" = ?, "pedimento" = ?, "cliente" = ?, "updated_at" = ? WHERE "operaciones"."id" = ?  [["referencia", "DESI0134/18"], ["pedimento", "3809-8000134"], ["cliente", "CASA MATUS"], ["updated_at", "2018-08-22 03:47:19.478701"], ["id", 2]]

    def set_operacione
      @operacione = Operacione.find(params[:id])
---
SELECT  "operaciones".* FROM "operaciones" WHERE "operaciones"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]